<?php


return [

    /*
    |--------------------------------------------------------------------------
    | customized http code
    |--------------------------------------------------------------------------
    |
    | The first number is error type, the second and third number is
    | product type, and it is a specific error code from fourth to
    | sixth.But the success is different.
    |
    */

    'code' => [
        200 => '成功',
        200001 => '缺少必要的参数',

        //文章
        503001 => '上传文件的格式不正确',
        503002 => '同步成功-记录保存失败',
        503003 => '权限错误',
        503004 => '文章保存失败', 
        403017 => '临近定时时间不能取消发送任务',
        403018 => '临近定时时间不能修改发送任务',
        403019 => '超过发送时间不能发送',
        403020 => '缺少发表记录ID参数',
        //SMS
        416001 => '添加成功,审核中,请耐心等待',
        416002 => '签名添加失败',

        304=>"没有数据返回",             // Not Modified
	400=>"请求数据不合法，或者超过请求频率限制", // Bad Request
	40001=>"API数据返回类型设定错误,目前支持的类型有json/xml",
	40002=>"请求的资源不存在，请检查API接口是否正确",
	40003=> "API接口错误(模块不存在)",
	40004=> "API接口错误(方法不存在)",
	40005=> "请求的HTTP METHOD不支持",
	40006=> "传入的接口参数不合法",
	40007=>"获取access_token时验证未通过，请检查app_id与app_key是否有效",
	40008=> "请使用https进行访问",
	40009=> "您的操作执行失败",
	40010=> "API版本错误",
	40011=>"上传失败，请使用小于5000KB的图片",
	40012=> "图片格式不支持,目前只支持jpg,jpeg,gif,bmp,png,请检查",
	4000001=>"",
	4000101=>"发送短信失败,请联系客服",
	4000102=>"您已经达到验证码获取上限,请联系客服",
	4000103=>"短信已发送过，请勿重复发送",
	4000104=>"短信模板不存在",
	4000105=>"通用错误",
	4000201=>"微信支付错误",
	4000202=>"微信支付,待用户验证支付密码",
	4000203=>"支付宝支付错误",
	4000204=>"支付宝支付,待用户验证支付密码",
	4000205=>"订单已经支付",
	4000206=>"订单已撤销／关闭／退款",
	4000301=>"类的方法调用方式（顺序）错误！",
	4000302=>"参数错误，缺少会员卡！",
	4000303=>"队列DB写入失败！",
	4000304=>"队列服务写入失败！",
	4000401=>"灯控状态已处于\"开启\"／\"关闭\"状态",
	401=>"没有进行身份验证",
	40101=> "授权出错，提供的access_token是无效的、过期的或已撤销的",
	40102=> "访问错误，接口不存在",
	40103=> "访问错误，接口不可用",
	40104=> "访问错误，没有访问接口的权限",
	40105=> "账号错误，提供的接口账号是无效的",
	40106=> "提供的接口账号没有授权，请检查您的过滤规则",
	40107=> "接口账户验证不通过",
	40108=> "授权失败，提供的app_id,app_key无效",
	40109=> "帐号未重置密码",
	40110=> "登录未选择商户",
	40111=> "登录未选择健身馆",
	403=>"没有权限访问对应的资源",
	40301=> "请求的方法没有权限",
	500=>"服务器内部错误",
	50001=> "papa核心服务未初始",
	50002=> "papa核心服务器链接异常",
	50003=> "papa核心服务器返回数据错误",
	50004=> "代码内部逻辑性错误，ModelSql类实例的属性未初始化",
	50005=> "xapian服务异常，请检查服务是否开启",
	50006=> "图片服务SDK---缺少配置图片服务器",
	50007=> "图片服务SDK---配置错误,缺少图片上传主机地址和请求域名",
	50008=> "图片服务SDK---配置错误，上传主机地址格式错误",
	50009=> "图片服务SDK---图片路径名称字符串长度不能超过255个",
	50010=> "图片服务SDK---图片服务器名称字符串长度不能超过20个",
	50011=> "图片服务SDK---图片服务器不存在",
	50012=> "图片服务SDK---上传的图片命名不能为空",
	50013=> "图片服务SDK---缺少应用ID配置",
	50014=> "Lock服务错误",
	500010101=>"应用内部初始化（参数配置）错误",
	500010102=>"应用内部路由失败",
	500010103=>"应用内部调度失败",
	500010104=>"应用内部程序文件加载失败",
	500010105=>"应用内部模块加载失败",
	500010106=>"应用内部控制器加载失败",
	500010107=>"应用内部控制器的方法调用失败",
	500010108=>"应用内部视图引擎加载失败",
	500010109=>"应用内部扩展加载失败",
	500010110=>"应用内部自载入机制（autoload）执行失败",
	500020101=>"应用内部，数据驱动层错误",
	502=>"接口API关闭或正在升级",
	502010101=>"错误码未定义",
	400110=>"数据库错误",
	400111=>"应用内部，Model层错误",
	400112=>"接口参数错误",
	400113=>"接口请求错误",
	400114=>"xlsx导出错误",

	//业务错误码，http(3)+项目(2)+顺序(3)
	//40001××× 公共中间件，支付模块
	40001000=>"支付错误",
	40001001=>"支付发起失败，参数错误",
	40001002=>"支付中，请查询确认",
	40001003=>"支付发起失败（平台返回），请检查后从新发起",
	40001004=>"支付被取消/或被关闭",
    ],

];
?>